docs: перерисовали архитектурную схему в Mermaid
